avrdudes/avr-libc/include/avr/ioavr16la14.h
/* Communication Signals select bit group values */
typedef enum USART_CSIG_VALUES_enum
{
    USART_CSIG_NORMAL_gv           = 0x00,  /* Normal Asynchronous USART, Synchronous USART or SPI Host */
    USART_CSIG_RS485_gv            = 0x01,  /* Asynchronous USART in RS485 mode */
    USART_CSIG_HANDSHAKE_gv        = 0x02,  /* Asynchronous USART with Hardware Handshake */
    USART_CSIG_CLKDIS_gv           = 0x03   /* SPI Host or Synchronous USART host without Clock Output */
} USART_CSIG_values_t;

/* Communication Signals select bit group configurations*/
typedef enum USART_CSIG_enum
{
    USART_CSIG_NORMAL_gc           = (USART_CSIG_NORMAL_gv << USART_CSIG_gp),  /* Normal Asynchronous USART, Synchronous USART or SPI Host */
    USART_CSIG_RS485_gc            = (USART_CSIG_RS485_gv << USART_CSIG_gp),  /* Asynchronous USART in RS485 mode */
    USART_CSIG_HANDSHAKE_gc        = (USART_CSIG_HANDSHAKE_gv << USART_CSIG_gp),  /* Asynchronous USART with Hardware Handshake */
    USART_CSIG_CLKDIS_gc           = (USART_CSIG_CLKDIS_gv << USART_CSIG_gp)   /* SPI Host or Synchronous USART host without Clock Output */
} USART_CSIG_t;

/* Data Order select bit group values */
typedef enum USART_DORD_VALUES_enum
{
    USART_DORD_LSB_gv              = 0x00,  /* LSb of the data word is transmitted first */
    USART_DORD_MSB_gv              = 0x01   /* MSb of the data word is transmitted first */
} USART_DORD_values_t;

/* Data Order select bit group configurations*/
typedef enum USART_DORD_enum
{
    USART_DORD_LSB_gc              = (USART_DORD_LSB_gv << USART_DORD_bp),  /* LSb of the data word is transmitted first */
    USART_DORD_MSB_gc              = (USART_DORD_MSB_gv << USART_DORD_bp)   /* MSb of the data word is transmitted first */
} USART_DORD_t;

/* Frame Format select bit group values */
typedef enum USART_FORM_VALUES_enum
{
    USART_FORM_NORMAL_gv           = 0x00,  /* Normal USART frame */
    USART_FORM_AUTOBAUD_gv         = 0x01,  /* Auto-baud mode */
    USART_FORM_LINHOST_gv          = 0x04,  /* LIN Host mode */
    USART_FORM_LINCLIENT_gv        = 0x05   /* LIN Client mode */
} USART_FORM_values_t;

/* Frame Format select bit group configurations*/
typedef enum USART_FORM_enum
{
    USART_FORM_NORMAL_gc           = (USART_FORM_NORMAL_gv << USART_FORM_gp),  /* Normal USART frame */
    USART_FORM_AUTOBAUD_gc         = (USART_FORM_AUTOBAUD_gv << USART_FORM_gp),  /* Auto-baud mode */
    USART_FORM_LINHOST_gc          = (USART_FORM_LINHOST_gv << USART_FORM_gp),  /* LIN Host mode */
    USART_FORM_LINCLIENT_gc        = (USART_FORM_LINCLIENT_gv << USART_FORM_gp)   /* LIN Client mode */
} USART_FORM_t;

/* Guard Time select bit group values */
typedef enum USART_GUARD_VALUES_enum
{
    USART_GUARD_1BIT_gv            = 0x00,  /* Guard time is 1 bit time */
    USART_GUARD_4BIT_gv            = 0x01,  /* Guard time is 4 bit times */
    USART_GUARD_8BIT_gv            = 0x02,  /* Guard time is 8 bit times */
    USART_GUARD_14BIT_gv           = 0x03   /* Guard time is 14 bit times */
} USART_GUARD_values_t;

/* Guard Time select bit group configurations*/
typedef enum USART_GUARD_enum
{
    USART_GUARD_1BIT_gc            = (USART_GUARD_1BIT_gv << USART_GUARD_gp),  /* Guard time is 1 bit time */
    USART_GUARD_4BIT_gc            = (USART_GUARD_4BIT_gv << USART_GUARD_gp),  /* Guard time is 4 bit times */
    USART_GUARD_8BIT_gc            = (USART_GUARD_8BIT_gv << USART_GUARD_gp),  /* Guard time is 8 bit times */
    USART_GUARD_14BIT_gc           = (USART_GUARD_14BIT_gv << USART_GUARD_gp)   /* Guard time is 14 bit times */
} USART_GUARD_t;

/* LIN Command select bit group values */
typedef enum USART_LINCMD_VALUES_enum
{
    USART_LINCMD_NORMAL_gv         = 0x00,  /* Normal USART frame */
    USART_LINCMD_BREAK_gv          = 0x01,  /* BREAK field transmitted when TXDATA is written */
    USART_LINCMD_HEADER_gv         = 0x02   /* BREAK and SYNC and identifier are auto tramsmitted when TXDATA is writtent with identifier */
} USART_LINCMD_values_t;

/* LIN Command select bit group configurations*/
typedef enum USART_LINCMD_enum
{
    USART_LINCMD_NORMAL_gc         = (USART_LINCMD_NORMAL_gv << USART_LINCMD_gp),  /* Normal USART frame */
    USART_LINCMD_BREAK_gc          = (USART_LINCMD_BREAK_gv << USART_LINCMD_gp),  /* BREAK field transmitted when TXDATA is written */
    USART_LINCMD_HEADER_gc         = (USART_LINCMD_HEADER_gv << USART_LINCMD_gp)   /* BREAK and SYNC and identifier are auto tramsmitted when TXDATA is writtent with identifier */
} USART_LINCMD_t;

/* Parity Mode select bit group values */
typedef enum USART_PMODE_VALUES_enum
{
    USART_PMODE_DISABLED_gv        = 0x00,  /* No Parity */
    USART_PMODE_EVEN_gv            = 0x02,  /* Even Parity */
    USART_PMODE_ODD_gv             = 0x03   /* Odd Parity */
} USART_PMODE_values_t;

/* Parity Mode select bit group configurations*/
typedef enum USART_PMODE_enum
{
    USART_PMODE_DISABLED_gc        = (USART_PMODE_DISABLED_gv << USART_PMODE_gp),  /* No Parity */
    USART_PMODE_EVEN_gc            = (USART_PMODE_EVEN_gv << USART_PMODE_gp),  /* Even Parity */
    USART_PMODE_ODD_gc             = (USART_PMODE_ODD_gv << USART_PMODE_gp)   /* Odd Parity */
} USART_PMODE_t;

/* Protocol Converter select bit group values */
typedef enum USART_PROTCONV_VALUES_enum
{
    USART_PROTCONV_NONE_gv         = 0x00,  /* Protocol conversion disabled. Normal data */
    USART_PROTCONV_FIXED_gv        = 0x01,  /* Single char for both '0' and '1'. Frame error set if values don't match */
    USART_PROTCONV_MASKED_gv       = 0x02,  /* CHARMASK works as a mask */
    USART_PROTCONV_DUAL_gv         = 0x03   /* CHARMASK defines second value for '1' */
} USART_PROTCONV_values_t;

/* Protocol Converter select bit group configurations*/
typedef enum USART_PROTCONV_enum
{
    USART_PROTCONV_NONE_gc         = (USART_PROTCONV_NONE_gv << USART_PROTCONV_gp),  /* Protocol conversion disabled. Normal data */
    USART_PROTCONV_FIXED_gc        = (USART_PROTCONV_FIXED_gv << USART_PROTCONV_gp),  /* Single char for both '0' and '1'. Frame error set if values don't match */
    USART_PROTCONV_MASKED_gc       = (USART_PROTCONV_MASKED_gv << USART_PROTCONV_gp),  /* CHARMASK works as a mask */
    USART_PROTCONV_DUAL_gc         = (USART_PROTCONV_DUAL_gv << USART_PROTCONV_gp)   /* CHARMASK defines second value for '1' */
} USART_PROTCONV_t;

/* Sample Rate select bit group values */
typedef enum USART_SAMPR_VALUES_enum
{
    USART_SAMPR_16X_gv             = 0x00,  /* 16x oversampling */
    USART_SAMPR_8X_gv              = 0x01   /* 8x oversampling (double speed) */
} USART_SAMPR_values_t;

/* Sample Rate select bit group configurations*/
typedef enum USART_SAMPR_enum
{
    USART_SAMPR_16X_gc             = (USART_SAMPR_16X_gv << USART_SAMPR_bp),  /* 16x oversampling */
    USART_SAMPR_8X_gc              = (USART_SAMPR_8X_gv << USART_SAMPR_bp)   /* 8x oversampling (double speed) */
} USART_SAMPR_t;

/* Stop Bit Mode select bit group values */
typedef enum USART_SBMODE_VALUES_enum
{
    USART_SBMODE_1BIT_gv           = 0x00,  /* 1 stop bit */
    USART_SBMODE_2BIT_gv           = 0x01   /* 2 stop bits */
} USART_SBMODE_values_t;

/* Stop Bit Mode select bit group configurations*/
typedef enum USART_SBMODE_enum
{
    USART_SBMODE_1BIT_gc           = (USART_SBMODE_1BIT_gv << USART_SBMODE_bp),  /* 1 stop bit */
    USART_SBMODE_2BIT_gc           = (USART_SBMODE_2BIT_gv << USART_SBMODE_bp)   /* 2 stop bits */
} USART_SBMODE_t;

